Artirally-Load/artillery-config.yml
config:
  target: "https://pippasync.customeradmin.boostonamazon.com"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 20
      name: "Sustained load"
  processor: "./login.js"
  playwright:
    headless: true
    timeout: 30000

scenarios:
  - name: "Login Flow"
    engine: "playwright"
    testFunction: "login"
    flow:
      - function: "login"